***** Installation
[[https://wiki.archlinux.org/title/Install][Install]] the [[https://archlinux.org/packages/?name=samba][samba]] package. 
sudo pacman -S samba

#+begin_src elisp
(find-file-other-frame "/sudo::/etc/samba/smb.conf")
#+end_src

#+RESULTS:
: #<buffer smb.conf>

#+begin_src elisp
(find-file-other-frame "/etc/samba/smb.conf")
#+end_src

#+RESULTS:
: #<buffer smb.conf>

Samba is configured in the /etc/samba/smb.conf configuration file,
which is extensively documented in [[https://man.archlinux.org/man/smb.conf.5][smb.conf(5)]]. 

Because the [[https://archlinux.org/packages/?name=samba][samba]] package does not provide this file, one needs to
create it before starting smb.service. 

A documented example as in smb.conf.default from the [[https://git.samba.org/samba.git/?p=samba.git;a=blob_plain;f=examples/smb.conf.default;hb=HEAD][Samba git
repository]] may be used to setup /etc/samba/smb.conf. 

** Necroteuch.org : 
		#+begin_src emacs-lisp :tangle yes
(find-file-other-frame "~/../Dropbox/orgs/capture/Necroteuch.org")
		#+end_src

		#+RESULTS:
		: #<buffer Necroteuch.org>

